{
    "run": {
        "num_train_episodes": 5000,
        "num_eval_episodes": 1000
    },
    "search": {
        "max_combinations": 1
    },
    "strategy": {
        "type": "Boltzmann",
        "max": 1,
        "min": 0.1,
        "decay": 0.001
    },
    "net": {
        "name": "2xDen",
        "layers": [{
            "class_name": "Flatten",
            "config": {
                "input_shape": [3, 3, 1]}
            },
            {
            "class_name": "Dense",
            "config": {
                "units": 128,
                "activation": "relu",
                "kernel_initializer": "glorot_uniform"}
            },
            {
            "class_name": "Dropout",
            "config": {"rate": 0.1}
            },
            {
            "class_name": "Dense",
                "config": {
                    "units": 128,
                    "activation": "relu",
                    "kernel_initializer": "glorot_uniform"}
            },
            {
            "class_name": "Dropout",
            "config": {
                "rate": 0.1}
            },
            {
            "class_name": "Dense",
            "config": {
                "units": 9,
                "activation": "linear"}
            }],
        "lr": 0.001,
        "loss": "huber_loss",
        "keras_version": "2.3.1"
    },
    "replay_memory": {
        "size": 25000,
        "minibatch_size": 128,
        "min_memory": 128
    },
    "algorithm": {
        "target_net_update_freq": 100,
        "discount": 0.99
    }
}
