{  
   "class_name":"Sequential",
   "config":{  
      "name":"sequential_1",
      "layers":[  
         {  
            "class_name":"Dense",
            "config":{  
	       "input_shape": [null, 9],
               "units":14,
               "activation":"relu"
            	}
         },
         {  
            "class_name":"Dense",
            "config":{  
               "units":8,
               "activation":"relu"
               }
         },
         {  
            "class_name":"Dense",
            "config":{  
               "units":1,
               "activation":"sigmoid"
               }
         }
      ]
   },
   "keras_version":"2.3.1",
   "backend":"tensorflow"
}